{
  "Technical Skills": [
    {
      "title": "Languages",
      "list": "JavaScript (Node.js, React.js, React Native), TypeScript, Python 3, SQL, C, Java 8, Bash, HTML/CSS"
    },
    {
      "title": "DevOps",
      "list": "AWS, Azure, Git, Docker, Apache, Nginx, IIS, MySQL, PostgreSQL, Microsoft SQL Server"
    },
    {
      "title": "Operating Systems",
      "list": "GNU/Linux (Ubuntu, Debian, Fedora), Microsoft Windows, MacOS, Android, iOS"
    }
  ],
  "Experience": [
    {
      "title": "Software Developer (Backend)",
      "company": "InFlight Corporation",
      "location": "Kitchener, Ontario",
      "timePeriod": "Mar. 2021 - Oct. 2021",
      "bullets": [
        "Worked alongside a small team in an agile environment to develop and evolve a specialized Node.js proxy server",
        "Individually developed and maintained numerous API projects used to provide additional functionality to client applications",
        "Frequently collaborated with frontend and implementation teams to design and test new application features",
        "Performed technical analysis of new packages and platforms used to improve server performance and stability"
      ]
    },
    {
      "title": "Mobile Developer (Contract)",
      "company": "National Logistics Services",
      "location": "Mississauga, Ontario",
      "timePeriod": "Oct. 2020 - Mar. 2021",
      "bullets": [
        "Leveraged the full stack of React Native, Node.js, and Microsoft SQL Server to implement a news bulletin system into a COVID-19 screening application, thus streamlining communication between upper management and employees",
        "Utilized Python scripting to automatically register all employees with an Okta authentication solution, allowing employees access to the mobile application"
      ]
    },
    {
      "title": "Mobile Developer Intern",
      "company": "National Logistics Services",
      "location": "Mississauga, Ontario",
      "timePeriod": "May 2019 - Dec. 2019",
      "bullets": [
        "Led development, integration, and testing of a billing automation web application to greatly reduce IT overheads and improve department workflow",
        "Deployed this application as an internal tool for use by general managers and executives to control the automated billing process for clients",
        "Led product meetings and discussions with various company executives "
      ]
    }
  ],
  "Education": [
    {
      "title": "Honours B.Comp, Major in Computer Science, Minor in Business",
      "company": "University of Guelph",
      "location": "Guelph, Ontario",
      "timePeriod": "Sept. 2016 - May 2020",
      "bullets": [
        "Notable courses: Cloud Computing, Database Systems & Concepts, Computer Networks, Parallel Programming, Intro to Cryptography, Systems Programming"
      ]
    }
  ]
}
